---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCImportOptions.Intent
source: html/6200e560-88d8-d10d-0cf9-ceb18ca15f3f.htm
---
# Autodesk.Revit.DB.IFC.IFCImportOptions.Intent Property

The intent of the import.

## Syntax (C#)
```csharp
public IFCImportIntent Intent { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration